title:  LsarSetSecret_key_creation
id: 
status: experimental
description: Modification of the Windows registry, specifically the creation and setting of registry keys and values associated with machine account passwords. 
author: Michael Vilshin
date: 06/26/2024
#modified: 
logsource:
  category: registry
  product: windows
  service: sysmon
detection:
  selection:
    selection_eventid: 
        EventID: 12
    selection_image:
        Image|endswith: '\lsass.exe'
    selection_eventtype:
        EventType: 'CreateKey'
    selection_target:
        TargetObject|contains: 'HKLM\SECURITY\Policy\Secrets\$MACHINE.ACC\CurrVal'
  condition: all of selection_*
fields: 
    - UtcTime
    - ProcessGuid
    - ProcessId
    - Image
    - TargetObject
    - User
falsepositives: 
    - A legitimate machine account password change initiated by the computer or any system member
level: High
references:
    - https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-lsad/21c1a153-032c-4869-afc9-186b2346dfab
    - 
tags: 
  - attack.credential_access
  - attack.t1003.001
