title: RDP Activasion With reg
id: c52a55c4-3d83-477f-b573-f46a31898907
status: test
description: detects usege of the regitry to open remote desktop for exfil or backdoor
author: Michael Vilshin
date: 2024/03/26
modified: 
logsource:
  category: process_creation
  product: windows
  service: sysmon
detection:
  selection:
    selection_image:
        - Image|endswith: '\reg.exe'
        - OriginalFileName: 'reg.exe'
    selection_flag:
        CommandLine|contains: 'add'
    selection_key:
        CommandLine|contains: 'HKLM\SYSTEM\CurrentControlSet\Control\Terminal Server'
    selection_value:
        CommandLine|contains: 'fDenyTSConnections'
    selection_type:
        CommandLine|contains: 'REG_DWORD'
    selection_data:
        CommandLine|contains: '/d 0'
  condition: all of selection_*
fields:
    - Image
    - OriginalFileName
    - CommandLine
falsepositives: 
    - administrator enabling rdp for maintanace
level: high
tags: 
  - attack.persistance
  - attack.defense_evasion
  - attack.t1133
  - attack.t1112
